{
  "filename": "contribution-guideline.md",
  "__html": "<h1>Contribution Guidelines</h1>\n<p>Welcome to Sentinel! This document is a guideline about how to contribute to Sentinel.\nIf you find something incorrect or missing, please leave comments / suggestions.</p>\n<h2>Before you get started</h2>\n<h3>Code of Conduct</h3>\n<p>Please make sure to read and observe our <a href=\"https://github.com/alibaba/Sentinel/blob/master/CODE_OF_CONDUCT.md\">Code of Conduct</a>.</p>\n<h3>Setting up your development environment</h3>\n<p>You should have JDK 1.8 or later installed in your system.</p>\n<h2>Contributing</h2>\n<p>We are always very happy to have contributions, whether for typo fix, bug fix or big new features.\nPlease do not ever hesitate to ask a question or send a pull request.</p>\n<p>We strongly value documentation and integration with other projects.\nWe are very glad to accept improvements for these aspects.</p>\n<h3>GitHub workflow</h3>\n<p>We use the <code>master</code> branch as the development branch, which indicates that this is a unstable branch.</p>\n<p>Here are the workflow for contributors:</p>\n<ol>\n<li>Fork to your own</li>\n<li>Clone fork to local repository</li>\n<li>Create a new branch and work on it</li>\n<li>Keep your branch in sync</li>\n<li>Commit your changes (keep your commit message <strong>concise and formatted</strong>, and make sure the email of your commits match the email of your GitHub account)</li>\n<li>Push your commits to your forked repository</li>\n<li>Create a pull request</li>\n</ol>\n<p>Please follow <a href=\"https://github.com/alibaba/Sentinel/blob/master/.github/PULL_REQUEST_TEMPLATE.md\">the pull request template</a>.\nPlease make sure the PR has a corresponding issue.</p>\n<p>After creating a PR, one or more reviewers will be assigned to the pull request.\nThe reviewers will review the code.</p>\n<p>Before merging a PR, squash any fix review feedback, typo, merged, and rebased sorts of commits.\nThe final commit message should be clear and concise.</p>\n<h3>Open an issue / PR</h3>\n<p>We use <a href=\"https://github.com/alibaba/Sentinel/issues\">GitHub Issues</a> and <a href=\"https://github.com/alibaba/Sentinel/pulls\">Pull Requests</a> for trackers.</p>\n<p>If you find a typo in document, find a bug in code, or want new features, or want to give suggestions,\nyou can <a href=\"https://github.com/alibaba/Sentinel/issues/new\">open an issue on GitHub</a> to report it.\nPlease follow the guideline message in the issue template.</p>\n<p>If you want to contribute, please follow the contribution workflow and create a new pull request.\nIf your PR contains large changes, e.g. component refactor or new components, please write detailed documents\nabout its design and usage.</p>\n<p>Note that a single PR should not be too large. If heavy changes are required, it's better to separate the changes\nto a few individual PRs.</p>\n<h3>Code review</h3>\n<p>All code should be well reviewed by one or more committers. Some principles:</p>\n<ul>\n<li>Readability: Important code should be well-documented. Comply with our code style.</li>\n<li>Elegance: New functions, classes or components should be well designed.</li>\n<li>Testability: Important code should be well-tested (high unit test coverage).</li>\n</ul>\n<h2>Community</h2>\n<h3>Contact us</h3>\n<h4>Mailing list</h4>\n<p>If you have any questions or advice, please contact <a href=\"mailto:sentinel@linux.alibaba.com\">sentinel@linux.alibaba.com</a>.</p>\n<h4>Gitter</h4>\n<p>Our Gitter room: <a href=\"https://gitter.im/alibaba/Sentinel\">https://gitter.im/alibaba/Sentinel</a>.</p>\n"
}