{
  "filename": "introduction.md",
  "__html": "<h1>Introduction</h1>\n<h1>What Is Sentinel?</h1>\n<p>As distributed systems are becoming increasingly popular, the reliability between services is becoming more important than ever before. Sentinel is a powerful flow control component that takes &quot;flow&quot; as the breakthrough point and covers multiple fields including flow control, concurrency limiting, circuit breaking, and adaptive system protection to guarantee the reliability of microservices.</p>\n<h2>History of Sentinel</h2>\n<ul>\n<li>2012, Sentinel was born in Alibaba with the main purpose of flow control.</li>\n<li>2013-2017, Sentinel grew fast and became a fundamental component for all microservices in Alibaba. It was used in more than 6000 applications and covers almost all core e-commerce scenarios.</li>\n<li>2018, Sentinel evolves into an open-source project.</li>\n<li>2020, <a href=\"https://github.com/alibaba/sentinel-golang\">Sentinel Go</a> released.</li>\n<li>2021, <a href=\"https://github.com/sentinel-group/sentinel-rust\">Sentinel Rust</a> released. And we've brought cool features like Envoy WASM extension and eBPF extension with Sentinel.</li>\n<li>2022, Sentinel evolves into a &quot;traffic governance&quot; cloud-native component.</li>\n</ul>\n<h1>Key Concepts</h1>\n<h2>Resource</h2>\n<p><strong>Resource</strong> is a key concept in Sentinel. It could be anything, such as a service, a method, or even a code snippet.</p>\n<p>Once it is wrapped by Sentinel API, it is defined as a resource and can apply for protections provided by Sentinel.</p>\n<h2>Rules</h2>\n<p>The way Sentinel protects resources is defined by rules, such as flow control, concurrency limiting, and circuit breaking rules. Rules can be dynamically changed, and take effect in real-time.</p>\n<h1>Features and Principles</h1>\n<h2>Flow Control</h2>\n<p>Sentinel provides the ability to handle random incoming requests according to the appropriate shape as needed, as illustrated below:</p>\n<p><img src=\"./img/sentinel-flow-overview-en.jpg\" alt=\"image\"></p>\n<h2>Principles of Flow Control</h2>\n<p>Flow control is based on the following statistics:</p>\n<ul>\n<li>Invocation chain between resources;</li>\n<li>Runtime metrics such as QPS, response time and system load;</li>\n<li>Desired actions to take, such as reject immediately or queueing.</li>\n</ul>\n<p>Sentinel allows applications to combine all these statistics in a flexible manner.</p>\n<h2>Circuit Breaking and Concurrency</h2>\n<p>Circuit breaking is used to detect failures and encapsulates the logic of preventing failure from constantly reoccurring during maintenance, temporary external system failure or unexpected system difficulties.</p>\n<p>To tackle this problem, <a href=\"https://github.com/Netflix/Hystrix/wiki#what-problem-does-hystrix-solve\">Hystrix</a> chose to use threads and thread-pools to achieve isolation. The main benefit of thread pools is that the isolation is thorough, but it could bring extra overheads and leads to problems in scenarios related to <code>ThreadLocal</code> (e.g. Spring transactions).</p>\n<p>Sentinel uses the following principles to implement circuit breaking:</p>\n<h3>Max concurrency limiting</h3>\n<p>Instead of using thread pools, Sentinel reduces the impact of unstable resources by restricting the number of concurrent threads (i.e. semaphore isolation).</p>\n<p>When the response time of a resource becomes longer, threads will start to be occupied. When the number of threads accumulates to a certain amount, new incoming requests will be rejected. Vice versa, when the resource restores and becomes stable, the occupied thread will be released as well, and new requests will be accepted.</p>\n<p>By restricting concurrent threads instead of thread pools, you no longer need to pre-allocate the size of the thread pools and can thus avoid the computational overhead such as the queueing, scheduling, and context switching.</p>\n<h3>Circuit breaking</h3>\n<p>Besides restricting the concurrency, downgrade unstable resources according to their response time is also an effective way to guarantee reliability. When the response time of a resource is too large, all access to the resource will be rejected in the specified time window.</p>\n<h2>Adaptive System Protection</h2>\n<p>Sentinel can be used to protect your server in case the system load or CPU usage goes too high. It helps you achieve a good balance between system load and incoming requests and the system can be restored very quickly.</p>\n<h1>How Sentinel works</h1>\n<p><img src=\"https://user-images.githubusercontent.com/9434884/69955207-1e5d3c00-1538-11ea-9ab2-297efff32809.png\" alt=\"image\"></p>\n<h1>Ecosystem Landscape</h1>\n<p><img src=\"https://user-images.githubusercontent.com/9434884/78636450-ef3a4b00-78da-11ea-89ce-c7a2b58c2deb.png\" alt=\"sentinel-opensource-eco-landscape-en\"></p>\n"
}